package exam01;

public class Sample01 {

	public static void main(String[] args) {
		/*
		 * 입출력(IO, Input/Output)
		 *     - 컴퓨터 내부/외부 장치간에 데이터를 주고받는 것
		 *     - 프로그램을 기준으로 내부/외부 장치에서 데이터가 현재 동작하는 프로그램으로 들어오면 입력
		 *       현재 동작하는 프로그램이 내부/외부 장치로 데이터를 보내면 출력
		 *       
		 * 스트림(Stream)
		 *     - 입력스트림, 출력스트림으로 나누어서 부른다.
		 *     - 두 장치간에 데이터를 지속적으로 입/출력하기 위해 생성된 연결 통로
		 *     - 단방향 통신을 지원하기 때문에 입력/출력을 동시에 할 수 없다.
		 *       동시에 하기 위해서 입력스트림, 출력스트림을 개별적으로 만든다.
		 *     - 스트림을 통해 데이터를 입/출력 할 때 문자기반스트림과 바이트기반스트림
		 *       으로 분류한다.
		 *     - 문자기반스트림의 경우 일반 텍스트 문서를 입/출력하기 위해 사용(보통 txt 확장자를 가지는 파일)
		 *     - 바이트기반스트림의 경우 일반 텍스트 문서를 제외한 모든 파일을 입/출력하기 위해 사용
		 *       (영상, 음향, 이미지, 각종 실행파일 등...)
		 */
	}

}
