package exam01;

public class Sample07 {

	public static void main(String[] args) {
		/*
		 * 현재 날짜를 구하고 다음 형식에 맞추어 출력하시오.
		 *     1. 2022/01/01
		 *     2. 2022년 01월 01일
		 *     3. 1월 1일
		 *     4. 오전 12시 00분 월요일
		 */
		
		/*
		 * 사용자 입력을 이용하여 현재 날짜에서 n일 을 추가하거나 뺐을 때의
		 * 날짜가 언제인지를 확인할 수 있게 출력하시오.
		 *     예)
		 *         일자 : 10
		 *         현재 날짜에서 10일 후 날짜는 2022년 04월 11일 입니다.
		 *         
		 *         일자 : -10
		 *         현재 날짜에서 10일 전 날짜는 2022년 03월 22일 입니다.
		 */
		
		/*
		 * 주민등록 앞 번호의 생년월일을 입력하면 날짜로 변환되어 출력할 수
		 * 있도록 하시오.
		 */
		
		/*
		 * 자신의 올해 생일이 몇일 남았는지 알 수 있도록 해주는 코드를 작성하시오.
		 */
		
		/*
		 * 프로그램이 동작한 후 부터 종료할 때까지의 시간 기록을 남기기 위한 코드를 작성하시오.
		 * 기록을 남기기 위한 프로그램은 1 ~ 100,000 까지의 누적합을 구하는 코드로 한다.
		 */
		
		/*
		 * 2020년 부터 2099년 까지의 년도 중 윤년에 해당하는 년도를 정수 배열에 담아 출력하시오.
		 */
		
		/*
		 * 2022년 04월 에서 주말에 해당하는 날짜만 날짜 배열에 저장하시오.
		 */
		
		/*
		 * 유튜브에서는 영상 업로드가 언제 이루어졌는지를 보여주는 형식이 x초 전 또는 x분 전, x시간 전
		 * x일 전, x주 전, x개월 전, y년 전 으로만 출력이 이루어지는데. 이를 동일하게 모방하여 사용자가
		 * 입력한 날짜가 현재 시간과 얼만큼의 차이가 있는지 출력하시오.
		 */
		
	}

}
