package exam05;

public class StudentList {
	/*
	 * Stduent 클래스를 배열 형식으로 관리할 수 있게 만드는 클래스
	 * 이 클래스로 다음의 기능을 제공하도록 한다.
	 *     - 학생 정보를 추가 할 수 있는 기능
	 *       (반드시 이름, 나이, 학년, 반 정보가 저장되도록 한다.)
	 *     - 학생 정보를 수정 할 수 있는 기능
	 *       (학생 이름으로 학년, 반 정보를 수정할 수 있게 한다.)
	 *     - 학생 정보를 삭제 할 수 있는 기능
	 *       (학생 이름 뿐만아니라 학년 정보로도 삭제할 수 있게 한다.
	 *        예로 3학년에 해당하는 학생 정보를 모두 삭제할 수 있게 하는 기능) 
	 *     - 학생 이름으로 학년, 반 정보를 제공하는 기능
	 *     - 학년 정보로 모든 학생의 이름을 제공하는 기능
	 *     - 학년, 반 정보로 모든 학생의 이름을 제공하는 기능
	 */
}
